<?php
return [
    /*
    |--------------------------------------------------------------------------
    | Языковые ресурсы аутентификации
    |--------------------------------------------------------------------------
    |
    | Следующие языковые ресурсы используются во время аутентификации для
    | различных сообщений которые мы должны вывести пользователю на экран.
    | Вы можете свободно изменять эти языковые ресурсы в соответствии
    | с требованиями вашего приложения.
    |
    */
    'failed' => 'Имя пользователя и пароль не совпадают.',
    'throttle' => 'Слишком много попыток входа. Пожалуйста, попробуйте еще раз через :seconds секунд.',
    'forgot' => 'Забыли пароль?',
    'login' => 'Логин',
    'password' => 'Пароль',
    'email' => 'E-Mail',
    'logout' => 'Выход',
    'reset_password' => 'Сбросить пароль',
    'verify_password' => 'Подтвердить пароль',
    'register' => 'Регистрация',
    'name' => 'Имя',
    'send_reset_link' => 'Отправить ссылку для сброса пароля',
    'verify_link_sent' => 'На ваш адрес электронной почты отправлена новая ссылка для подтверждения.',
    'check_verification_link' => 'Прежде чем продолжить, проверьте свою электронную почту на наличие ссылки для подтверждения.',
    'receive' => 'Если вы не получили письмо',
    'request_another' => 'нажмите здесь, чтобы запросить другое'
];