<?php

return [
    'not_found_title' => 'Страница не найдена',
    'not_found_message' => 'Извините, данная страница не существует.',
    'btn_text' => 'На главную',
    'pay' => [
        'fail' => 'Ваш заказ отменен :(',
        'cancel' => 'Ваш заказ отменен :(',
        'decline' => 'Ваш заказ отменен :(',
        'success' => 'Ваш заказ оплачен',
        'notify' => [
            'success' => 'Спасибо за оплату! :) С Вами свяжется наш менеджер.',
            'hacker' => 'А что вы пытаетесь сделать?'
        ]
    ]
];
