<?php

return [
    'app' => 'Панель',
    'dashboard' => 'Статистика',
    'messages' => 'Сообщения',
    'store' => 'Магазин',
    'users' => 'Пользователи',
    'profile' => 'Профиль',
    'doc' => 'Справка',
    'panel' => 'Профиль',
    'search_result' => 'Результаты поиска',
    'search' => 'Поиск',
    'title' => 'Название',
    'status' => 'Статус',
    'description' => 'Описание',
    'actions' => 'Действия',
    'created_at' => 'Создано',
    'id' => 'ID',
    'key' => 'Ключ',
    'export' => 'Экспортировать csv',
    'select' => [
        'image' => 'Выберите картинку',
        'switch' => [
            'on' => 'Вкл',
            'off' => 'Выкл'
        ]
    ],
    'btn' => [
        'confirm' => [
            'destroy' => 'Удалить данные?',
            'ok' => 'Хорошо',
            'cancel' => 'Отмена'
        ],
    ],
    'footer' => [
        'header' => 'Панель управления',
        'description' => 'Разработана индивидульна для ООО "Дом папочки".',
    ],
    'user' => [
        'header' => 'Пользователи',
        'description' => 'Выберите пользователя или создайте нового',
        'create' => 'Создать пользователя',
        'edit' => 'Отредактировать пользователя',
        'destroy' => 'Удалить пользователя',

        'name' => 'Имя пользователя',
        'email' => 'E-mail',
        'password' => 'Пароль',
        'phone' => 'Номер телефона',
        'avatar' => 'Фото пользователя'
    ],
    'pages' => [
        'header' => 'Страницы',
        'description' => 'Выберите страницу или создайте новую',
        'create' => 'Создать страницу',
        'edit' => 'Отредактировать страницу',
        'destroy' => 'Удалить страницу',
        'slug' => 'Адрес страницы',

        'title' => 'Заголовок',
        'text' => 'Текст',
        'status' => [
            'title' => 'Статус',
            'on' => 'Опубликовано',
            'off' => 'Черновик'
        ],
    ],
    'navs' => 'Навигация',
    'nav' => [
        'header' => 'Навигация (меню)',
        'description' => 'Выберите пункт меню или создайте новый',
        'create' => 'Создать пункт меню',
        'edit' => 'Отредактировать пункт меню',
        'destroy' => 'Удалить пункт меню',

        'title' => 'Заголовок',
        'url' => 'Ссылка',
        'order' => 'Приоритет',
        'parent' => 'Родительский пункт меню',
        'status' => [
            'title' => 'Статус',
            'on' => 'Опубликовано',
            'off' => 'Черновик'
        ],
    ],
    'orders' => 'Заказы',
    'order' => [
        'header' => 'Заказы',
        'description' => 'Проверьте заказы',
        'create' => 'Создать заказ',
        'edit' => 'Отредактировать заказ',
        'destroy' => 'Удалить заказ',

        'fields' => [
            'name' => 'Имя клиента',
            'phone' => 'Телефон',
            'cart_data' => 'Заказ',
            'message' => 'Комментарий клиента',
            'address' => 'Адрес доставки',
            'slug' => 'Адрес заказа',
            'cart' => 'Заказ',
            'delivery_info' => 'Информация для службы доставки',
            'status' => [
                'title' => 'Статус',
                'new                    ' => 'Новый',
                'treatment              ' => 'Обработан',
                'cooking                ' => 'Готовиться',
                'delivery' => [
                    'success            ' => 'Доставлен',
                    'cancel             ' => 'Отменен',
                    'fail               ' => 'Не доставлен',
                ],
                'remove                 ' => 'Удален',

                'pay' => [
                    'progress           ' => 'Не оплачен',
                    'cancel             ' => 'Отменен',
                    'success            ' => 'Оплачен',
                ]
            ],
        ]
    ],
    'slides' => 'Слайды',
    'slide' => [
        'header' => 'Слайды',
        'description' => 'Выберите слайд или создайте новый',
        'create' => 'Создать слайд',
        'edit' => 'Отредактировать слайд',
        'destroy' => 'Удалить слайд',

        'fields' => [
            'title' => 'Заголовок',
            'filepath' => 'Картинка',
            'order' => 'Приоритет',
            'status' => [
                'title' => 'Статус',
                'on' => 'Опубликовано',
                'off' => 'Черновик'
            ],
        ]
    ],
    'categories' => 'Категории',
    'category' => [
        'header' => 'Категории',
        'description' => 'Выберите категорию или создайте новую',
        'create' => 'Создать категорию',
        'edit' => 'Отредактировать категорию',
        'destroy' => 'Удалить категорию',

        'fields' => [
            'title' => 'Заголовок',
            'text' => 'Текст',
            'parent' => 'Родительская категория',
            'slug' => 'Адрес категории',
            'filepath' => 'Картинка, путь к картинке',
            'show_on_homepage' => [
                'title' => 'Показывать на Главной',
                'on' => 'Да',
                'off' => 'Нет'
            ],
            'show_in_navigate' => [
                'title' => 'Показывать в меню',
                'on' => 'Да',
                'off' => 'Нет'
            ],
            'status' => [
                'title' => 'Статус',
                'on' => 'Опубликовано',
                'off' => 'Черновик'
            ],
        ]
    ],
    'products' => 'Товары',
    'product' => [
        'header' => 'Товары',
        'description' => 'Выберите товар или создайте новый',
        'create' => 'Создать товар',
        'edit' => 'Отредактировать товар',
        'destroy' => 'Удалить товар',

        'fields' => [
            'title' => 'Заголовок',
            'text' => 'Текст продукта (seo текст)',
            'description' => 'Описание, состав, комплекция',
            'name1' => 'Название первого варианта',
            'detail1' => 'Детали первого варианта',
            'price1' => 'Цена первого варианта',
            'name2' => 'Название второго варианта',
            'detail2' => 'Детали второго варианта',
            'price2' => 'Цена второго варианта',
            'name3' => 'Название третьего варианта',
            'detail3' => 'Детали третьего варианта',
            'price3' => 'Цена третьего варианта',
            'filepath' => 'Картинка',
            'category' => 'Категория',
            'slug' => 'Адрес продукта',
            'label' => [
                'title' => 'Отметка',
                'normal' => 'Без отметки - обычный товар',
                'popular' => 'Популярный',
                'hot' => 'Горячий'
            ],
            'status' => [
                'title' => 'Статус',
                'on' => 'Опубликовано',
                'off' => 'Черновик'
            ],
        ]
    ],
    'cart' => [
        'title' => 'Корзина',
        'table' => [
            'img' => 'Изображение',
            'title' => 'Товар',
            'count' => 'Количество',
            'price' => 'Цена',
        ],
        'form' => [
            'current' => 'руб',
            'total' => 'Итого',
            'btn' => 'Сделать заказ',
            'contacts' => [
                'title' => 'Ваши контактные данные',
                'name' => 'Ваше имя',
                'phone' => 'Ваш телефон',
                'comment' => 'Дополнительные данные',
            ],
            'pay' => [
                'title' => 'Оплата',
                'cash' => 'наличными',
                'card' => 'картой банка',
                'online' => 'online картой банка',
                'erip' => 'оплата через ЕРИП',
            ],
            'delivery' => [
                'title' => 'Доставка',
                'pickup' => 'самовывоз',
                'delivery' => 'доставка',
                'time' => 'Выберите дату и время доставки:',
                'onlyDate' => 'Выберите дату',
            ],
            'timeOfDelivery' => [
                '0' => 'Выберите время',
                '1' => '10:00-10:30',
                '2' => '10:30-11:00',
                '3' => '11:00-11:20',
                '4' => '11:20-11:40',
                '5' => '11:40-12:00',
                '6' => '12:00-12:20',
                '7' => '12:20-12:40',
                '8' => '12:40-13:00',
                '9' => '13:00-13:20',
                '10' => '13:20-13:40',
                '11' => '13:40-14:00',
                '12' => '14:00-14:20',
                '13' => '14:20-14:40',
                '14' => '14:40-15:00',
                '15' => '15:00-15:20',
                '16' => '15:20-15:40',
                '17' => '15:40-16:00',
                '18' => '16:00-16:20',
                '19' => '16:20-16:40',
                '20' => '16:40-17:00',
                '21' => '17:00-17:20',
                '22' => '17:20-17:40',
                '23' => '17:40-18:00',
                '24' => '18:00-18:20',
                '25' => '18:20-18:40',
                '26' => '18:40-19:00',
                '27' => '19:00-19:20',
                '28' => '19:20-19:40',
                '29' => '19:40-20:00"',
                '30' => '20:00-20:20',
                '31' => '20:20-20:40',
                '32' => '20:40-21:00',
                '33' => '21:00-21:20',
                '34' => '21:20-21:40',
                '35' => '21:40-22:00',
                '36' => '22:00-22:20',
                '37' => '22:20-22:40',
            ],
            'address' => [
                'title' => 'Адрес',
                'street' => 'Улица',
                'house' => 'Дом',
                'house2' => 'Подъезд',
                'floor' => 'Этаж',
                'house3' => 'Корпус',
                'flat' => 'Квартира'
            ],
        ]
    ],
    'delivery' => [
        'title' => 'Заказ принят',
        'description' => 'Ожидайте звонка нашего специалиста',
        'number' => 'Номер заказа',
        'order' => 'Ваш заказ',
    ],
    'error' => [
        '404' => [
            'title' => 'У нас нет такой страницы =(',
            'description' => 'У нас вкусное меню - посмотрите там)',
        ]
    ],
    'roles' => 'Роли',
    'role' => [
        'header' => 'Роли',
        'description' => 'Опишите для чего эта роль нужна',
        'create' => 'Создать роль',
        'edit' => 'Отредактировать роль',
        'destroy' => 'Удалить роль',

        'title' => 'Заголовок',
        'display_name' => 'Название',
        'name' => 'Ключ',
    ],
    'permissions' => 'Правила',
    'permission' => [
        'header' => 'Правила',
        'description' => 'Опишите для чего это правило нужно',
        'create' => 'Создать правило',
        'edit' => 'Отредактировать правило',
        'destroy' => 'Удалить правило',

        'title' => 'Заголовок',
        'display_name' => 'Название',
        'name' => 'Ключ',
    ],
    'settings' => [
        'header' => 'Настройки',
        'description' => 'Выберите настройку или создайте новую',
        'create' => 'Создать настройку',
        'edit' => 'Отредактировать настройку',
        'destroy' => 'Удалить настройку',

        'title' => 'Заголовок',
        'value' => 'Значение',
        'key' => 'Ключ',
        'type' => 'Тип',
        'types' => [
            'STRING' => 'Строка текста',
            'EDITOR' => 'Текст - редактор',
            'TEXTAREA' => 'Текст - блок',
            'INTEGER' => 'Число',
            'FILE' => 'Файл',
            'DATE' => 'Дата',
            'DATETIME' => 'Дата и время',
            'HTML' => 'Html',
            'SWITCHER' => 'Переключатель',
        ],
    ],
    'seo' => [
        'header' => 'Поисковая оптимизация',
        'title' => 'Заголовок',
        'description' => 'Описание',
        'keys' => 'Ключи',
    ],
    'message' => [
        'valid' => 'Данные введены успешно',
        'invalid' => 'Обязательно для заполнения'
    ],

    'new' => 'Новая',
    'edit' => 'Изменить',
    'destroy' => 'Удалить',
    'create' => 'Создать',
    'save' => 'Сохранить',
    'cancel' => 'Отменить',
    'email' => [
        'messages' => [
            'order' => [
                'subject' => 'Заказ с сайта'
            ]
        ]
    ]
];
